Revit 2027 API
Connector.AssignedDuctLossMethod Property
The duct loss method of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctLossMethodType AssignedDuctLossMethod { get; }
Public ReadOnly Property AssignedDuctLossMethod As DuctLossMethodType
	Get
public:
property DuctLossMethodType AssignedDuctLossMethod {
	DuctLossMethodType get ();
}
member AssignedDuctLossMethod : DuctLossMethodType with get
Property Value
DuctLossMethodType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainHvac. Thrown when the connector is not in family instance.
InvalidOperationException |  Thrown on failure to get duct loss method.
Remarks
Assigned duct loss method may be assigned for connectors of some family instances.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace